Table of Contents
 Class ConnectedMemberIdentifier<T>
Namespace
IdeaStatiCa.BimApiLink.Identifiers
Assembly
IdeaStatiCa.BimApiLink.dll
public class ConnectedMemberIdentifier<T> : ImmutableIdentifier<T>, IIdentifier, IIdeaPersistenceToken, IEquatable<IIdentifier> where T : IIdeaObject
Type Parameters
T
Inheritance
object
Identifier<T>
ImmutableIdentifier<T>
ConnectedMemberIdentifier<T>
Implements
IIdentifier
IIdeaPersistenceToken
IEquatable<IIdentifier>
Inherited Members
 Identifier<T>.ObjectType
 Identifier<T>.Equals(IIdentifier)
 Identifier<T>.Equals(object)
 Identifier<T>.GetHashCode()
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 ConnectedMemberIdentifier()
public ConnectedMemberIdentifier()
 ConnectedMemberIdentifier(Identifier<IIdeaMember1D>)
public ConnectedMemberIdentifier(Identifier<IIdeaMember1D> id)
Parameters
id Identifier<IIdeaMember1D>
 ConnectedMemberIdentifier(string)
public ConnectedMemberIdentifier(string id)
Parameters
id string
Properties
 AutoAddCutByWorkplane
public bool AutoAddCutByWorkplane { get; set; }
Property Value
bool
 ConnectedMemberType
public IdeaConnectedMemberType ConnectedMemberType { get; set; }
Property Value
IdeaConnectedMemberType
 ForcesIn
public IdeaForcesIn ForcesIn { get; set; }
Property Value
IdeaForcesIn
 GeometricalType
public IdeaGeometricalType GeometricalType { get; set; }
Property Value
IdeaGeometricalType
 IdeaMember
public Identifier<IIdeaMember1D> IdeaMember { get; set; }
Property Value
Identifier<IIdeaMember1D>
 IsBearing
public bool IsBearing { get; set; }
Property Value
bool
 IsReferenceLineInCenterOfGravity
public bool IsReferenceLineInCenterOfGravity { get; set; }
Property Value
bool
 MemberSegmentType
public IdeaBeamSegmentModelType MemberSegmentType { get; set; }
Property Value
IdeaBeamSegmentModelType
Methods
 GetId()
public override object GetId()
Returns
object
 GetStringId()
public override string GetStringId()
Returns
string
 Edit this page